---
kind: type
id: T:Autodesk.Revit.DB.CurveByPointsArray
source: html/05d7b8f5-e891-e58f-c1aa-3e0e5d96d19c.htm
---
# Autodesk.Revit.DB.CurveByPointsArray

An array that can contain CurveByPoints elements.

## Syntax (C#)
```csharp
public class CurveByPointsArray : APIObject,
	IEnumerable
```